tests/integration/bajaj/test_data/bom_feed.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://local.bajaj.gladminds.co:8000/api/v1/feed/">
  <SOAP-ENV:Body>
    <ns1:postBillOfMaterial>
      <ns1:ObjectList>
        <ns1:BOMData>
         <ns1:BOMModel>
          <ns1:BOMTIMESTAMP>        
            	<ns1:TIMESTAMP>2005-08-01000000</ns1:TIMESTAMP>
		   </ns1:BOMTIMESTAMP>
           <ns1:ITEMFIELD>
             <ns1:ItemFieldModel>
	 			<ns1:PLATE_TXT>Chain Case</ns1:PLATE_TXT>
	            <ns1:VALID_FROM>2010-12-01</ns1:VALID_FROM>
				<ns1:REVISION_NO>0</ns1:REVISION_NO>
             	<ns1:BOM_NUMBER>211760</ns1:BOM_NUMBER>
                <ns1:PLATE_ID>44</ns1:PLATE_ID>
             	<ns1:VALID_TO>9999-12-31</ns1:VALID_TO>
             	<ns1:QTY>1</ns1:QTY>
                <ns1:ITEM>1</ns1:ITEM>
				<ns1:PART_NUMBER>15161069</ns1:PART_NUMBER>
				<ns1:CHANGE_NUMBER_TO></ns1:CHANGE_NUMBER_TO>
				<ns1:ITEM_ID>1</ns1:ITEM_ID>
				<ns1:SERIAL_NUMBER></ns1:SERIAL_NUMBER>
				<ns1:CHANGE_NUMBER>SCH01011210</ns1:CHANGE_NUMBER>
				<ns1:UOM>EA</ns1:UOM>
             </ns1:ItemFieldModel>
             <ns1:ItemFieldModel>
                <ns1:PLATE_TXT>Rider Foot Rest</ns1:PLATE_TXT>
                <ns1:VALID_FROM>2010-12-01</ns1:VALID_FROM>
                <ns1:REVISION_NO>0</ns1:REVISION_NO>
                <ns1:BOM_NUMBER>211760</ns1:BOM_NUMBER>
                <ns1:PLATE_ID>27</ns1:PLATE_ID>
                <ns1:VALID_TO>9999-12-31</ns1:VALID_TO>
                <ns1:QTY>2</ns1:QTY>
                <ns1:ITEM>2</ns1:ITEM>
                <ns1:PART_NUMBER>22150451</ns1:PART_NUMBER>
                <ns1:CHANGE_NUMBER_TO></ns1:CHANGE_NUMBER_TO>
                <ns1:ITEM_ID>2</ns1:ITEM_ID>
                <ns1:SERIAL_NUMBER></ns1:SERIAL_NUMBER>
                <ns1:CHANGE_NUMBER>SCH01011210</ns1:CHANGE_NUMBER>
                <ns1:UOM>EA</ns1:UOM>
             </ns1:ItemFieldModel>
             <ns1:ItemFieldModel>
                <ns1:PLATE_TXT>Transmission</ns1:PLATE_TXT>
                <ns1:VALID_FROM>2010-12-01</ns1:VALID_FROM>
                <ns1:REVISION_NO>0</ns1:REVISION_NO>
                <ns1:BOM_NUMBER>211760</ns1:BOM_NUMBER>
                <ns1:PLATE_ID>8</ns1:PLATE_ID>
                <ns1:VALID_TO>9999-12-31</ns1:VALID_TO>
                <ns1:QTY>1</ns1:QTY>
                <ns1:ITEM>3</ns1:ITEM>
                <ns1:PART_NUMBER>30101061</ns1:PART_NUMBER>
                <ns1:CHANGE_NUMBER_TO></ns1:CHANGE_NUMBER_TO>
                <ns1:ITEM_ID>3</ns1:ITEM_ID>
                <ns1:SERIAL_NUMBER></ns1:SERIAL_NUMBER>
                <ns1:CHANGE_NUMBER>SCH01011210</ns1:CHANGE_NUMBER>
                <ns1:UOM>EA</ns1:UOM>
             </ns1:ItemFieldModel>
        	</ns1:ITEMFIELD>
            <ns1:HEADERFIELD>
               <ns1:HeaderFieldModel>
                <ns1:PLANT>CH01</ns1:PLANT>
                <ns1:VALID_FROM>2010-01-22</ns1:VALID_FROM>		
                <ns1:BOM_NO>211760</ns1:BOM_NO>
			    <ns1:VALID_TO>9999-12-31</ns1:VALID_TO>            
		        <ns1:SKU_CODE>00DH15ZZ</ns1:SKU_CODE>            		
           	    <ns1:CREATED_ON>2011-06-24</ns1:CREATED_ON>
				<ns1:BOM_TYPE>S</ns1:BOM_TYPE>
              </ns1:HeaderFieldModel>
  	    	</ns1:HEADERFIELD>
         </ns1:BOMModel>
        </ns1:BOMData>
      </ns1:ObjectList>
      <ns1:Credential>
        <ns1:UserName>bajaj</ns1:UserName>
        <ns1:Password>bajaj</ns1:Password>
      </ns1:Credential>
    </ns1:postBillOfMaterial>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>